In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\HP'

In [3]:
ls

 Volume in drive C is Windows
 Volume Serial Number is AC7E-C806

 Directory of C:\Users\HP

07-09-2023  13:57    <DIR>          .
21-07-2023  00:17    <DIR>          ..
09-07-2023  23:06    <DIR>          .android
17-04-2023  21:12               470 .bash_history
07-09-2023  13:59    <DIR>          .conda
07-09-2023  12:49                25 .condarc
12-04-2023  09:32    <DIR>          .config
01-09-2023  00:26    <DIR>          .continuum
17-04-2023  20:45                53 .gitconfig
09-07-2023  22:55    <DIR>          .gradle
07-09-2023  13:51    <DIR>          .ipynb_checkpoints
01-09-2023  00:41    <DIR>          .ipython
01-09-2023  01:04    <DIR>          .jupyter
09-07-2023  22:58    <DIR>          .m2
05-03-2023  22:35    <DIR>          .ms-ad
06-08-2023  19:59                74 .node_repl_history
06-08-2023  19:42    <DIR>          .rest-client
17-04-2023  21:10    <DIR>          .ssh
17-06-2023  11:16    <DIR>          .vscode
01-09-2023  00:27    <DIR>          anaconda3
09-07-2023  22:52    <DIR>          AndroidStudioProjects
23-08-2023  22:30    <DIR>          app
17-06-2023  11:19    <DIR>          clone_website
06-09-2023  13:26            45,645 combining dataframes.ipynb
04-09-2023  12:14           102,536 Conditional Filtering.ipynb
03-09-2023  13:26            66,233 dataframes.ipynb
17-06-2023  11:22    <DIR>          DeliveryRouteFinder
06-09-2023  19:43    <DIR>          Downloads
05-04-2023  22:21    <DIR>          DS-Project
17-06-2023  11:17    <DIR>          DS-Project-1
04-04-2023  22:59    <DIR>          DSW_Project
14-05-2023  13:08    <DIR>          Favorites
05-09-2023  13:35           222,715 Group by.ipynb
26-07-2023  19:56    <DIR>          Hackathon_Project
07-09-2023  13:57               751 input and output.ipynb
05-09-2023  12:32            30,305 missing data.ipynb
07-04-2023  23:59    <DIR>          Mobikart-Mobile-E-Commerce-Website
07-04-2023  23:52    <DIR>          mobile-shop-backend
01-09-2023  00:40               177 movie_scores.csv
01-09-2023  00:40            17,727 mpg.csv
06-03-2023  10:25    <DIR>          Music
02-09-2023  12:53            35,074 numpy.ipynb
07-09-2023  12:20    <DIR>          OneDrive
08-04-2023  00:02    <DIR>          Online-Mobile-Shopping-
08-04-2023  00:05    <DIR>          online-shopping
03-09-2023  11:00             9,272 pandas series.ipynb
04-09-2023  14:12            88,946 pandas-useful methods.ipynb
04-04-2023  22:54    <DIR>          portfolio
09-04-2023  10:58    <DIR>          Postman
01-09-2023  00:40             5,459 RetailSales_BeerWineLiquor.csv
11-03-2023  16:02    <DIR>          Saved Games
08-04-2023  11:03    <DIR>          Searches
06-09-2023  14:38            10,383 Text methods.ipynb
07-09-2023  13:50            22,287 Time methods.ipynb
01-09-2023  00:40            18,752 tips.csv
03-09-2023  12:16                 0 tips.csv.txt
01-09-2023  00:46             1,023 Untitled.ipynb
01-09-2023  01:06             1,341 Untitled1.ipynb
05-09-2023  12:37                72 Untitled10.ipynb
01-09-2023  01:30             1,077 Untitled2.ipynb
01-09-2023  01:35             1,077 Untitled3.ipynb
02-09-2023  10:51             3,160 Untitled4.ipynb
03-09-2023  10:26                72 Untitled5.ipynb
03-09-2023  11:48                72 Untitled6.ipynb
04-09-2023  11:56               589 Untitled7.ipynb
04-09-2023  12:18                72 Untitled8.ipynb
05-09-2023  12:18            22,570 Untitled9.ipynb
10-03-2023  16:48    <DIR>          Videos
              31 File(s)        708,009 bytes
              37 Dir(s)  21,732,909,056 bytes free

In [4]:
import os

In [5]:
os.getcwd()

'C:\\Users\\HP'

In [13]:
df = pd.read_csv('example.csv',index_col=0)

In [14]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [17]:
df.to_csv('newfile.csv',index=False)

In [18]:
new = pd.read_csv("newfile.csv")

In [19]:
new

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15

In [20]:
import pandas as pd

In [21]:
url = "https://en.wikipedia.org/wiki/World_population"

In [22]:
tables = pd.read_html(url)

In [23]:
len(tables)

29

In [24]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1930,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",126,30,14,13,12,12,11,15,20

In [27]:
world_topten = tables[1]

In [28]:
tables[1].columns

Index(['Region', '2022 (percent)', '2030 (percent)', '2050 (percent)'], dtype='object')

In [30]:
world_topten

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [31]:
world_topten = world_topten.drop(8, axis=0)

In [32]:
world_topten

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)

In [33]:
world_topten.columns = ['Country', '200', '2015', '2030 Est.']

In [34]:
world_topten

,Country,200,2015,2030 Est.
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)

In [37]:
tables[7].set_index('Rank')

                     Country  Population  Area (km2)  Density (pop/km2)
Rank
1                  Singapore     5921231         719               8235
2                 Bangladesh   165650475      148460               1116
3     Palestine[note 3][103]     5223000        6025                867
4             Taiwan[note 4]    23580712       35980                655
5                South Korea    51844834       99720                520
6                    Lebanon     5296814       10400                509
7                     Rwanda    13173730       26338                500
8                    Burundi    12696478       27830                456
9                      India  1389637446     3287263                423
10               Netherlands    17400824       41543                419

In [39]:
world_topten.to_html('sample_table.html', index=False)

In [40]:
import pandas as pd

In [43]:
ls

 Volume in drive C is Windows
 Volume Serial Number is AC7E-C806

 Directory of C:\Users\HP

07-09-2023  15:37    <DIR>          .
21-07-2023  00:17    <DIR>          ..
09-07-2023  23:06    <DIR>          .android
17-04-2023  21:12               470 .bash_history
07-09-2023  15:37    <DIR>          .conda
07-09-2023  12:49                25 .condarc
12-04-2023  09:32    <DIR>          .config
01-09-2023  00:26    <DIR>          .continuum
17-04-2023  20:45                53 .gitconfig
09-07-2023  22:55    <DIR>          .gradle
07-09-2023  13:51    <DIR>          .ipynb_checkpoints
01-09-2023  00:41    <DIR>          .ipython
01-09-2023  01:04    <DIR>          .jupyter
09-07-2023  22:58    <DIR>          .m2
05-03-2023  22:35    <DIR>          .ms-ad
06-08-2023  19:59                74 .node_repl_history
06-08-2023  19:42    <DIR>          .rest-client
17-04-2023  21:10    <DIR>          .ssh
17-06-2023  11:16    <DIR>          .vscode
01-09-2023  00:27    <DIR>          anaconda3
09-07-2023  22:52    <DIR>          AndroidStudioProjects
23-08-2023  22:30    <DIR>          app
17-06-2023  11:19    <DIR>          clone_website
06-09-2023  13:26            45,645 combining dataframes.ipynb
04-09-2023  12:14           102,536 Conditional Filtering.ipynb
03-09-2023  13:26            66,233 dataframes.ipynb
17-06-2023  11:22    <DIR>          DeliveryRouteFinder
06-09-2023  19:43    <DIR>          Downloads
05-04-2023  22:21    <DIR>          DS-Project
17-06-2023  11:17    <DIR>          DS-Project-1
04-04-2023  22:59    <DIR>          DSW_Project
01-09-2023  00:40                51 example.csv
01-09-2023  00:40             5,022 example.xlsx
14-05-2023  13:08    <DIR>          Favorites
05-09-2023  13:35           222,715 Group by.ipynb
26-07-2023  19:56    <DIR>          Hackathon_Project
07-09-2023  15:37            41,543 input and output.ipynb
05-09-2023  12:32            30,305 missing data.ipynb
07-04-2023  23:59    <DIR>          Mobikart-Mobile-E-Commerce-Website
07-04-2023  23:52    <DIR>          mobile-shop-backend
01-09-2023  00:40               177 movie_scores.csv
01-09-2023  00:40            17,727 mpg.csv
06-03-2023  10:25    <DIR>          Music
01-09-2023  00:40             5,022 my_excel_file.xlsx
07-09-2023  14:06                40 newfile.csv
02-09-2023  12:53            35,074 numpy.ipynb
07-09-2023  12:20    <DIR>          OneDrive
08-04-2023  00:02    <DIR>          Online-Mobile-Shopping-
08-04-2023  00:05    <DIR>          online-shopping
03-09-2023  11:00             9,272 pandas series.ipynb
04-09-2023  14:12            88,946 pandas-useful methods.ipynb
04-04-2023  22:54    <DIR>          portfolio
09-04-2023  10:58    <DIR>          Postman
01-09-2023  00:40             5,459 RetailSales_BeerWineLiquor.csv
07-09-2023  15:01             1,382 sample_table.html
11-03-2023  16:02    <DIR>          Saved Games
08-04-2023  11:03    <DIR>          Searches
06-09-2023  14:38            10,383 Text methods.ipynb
07-09-2023  13:50            22,287 Time methods.ipynb
01-09-2023  00:40            18,752 tips.csv
03-09-2023  12:16                 0 tips.csv.txt
01-09-2023  00:46             1,023 Untitled.ipynb
01-09-2023  01:06             1,341 Untitled1.ipynb
05-09-2023  12:37                72 Untitled10.ipynb
01-09-2023  01:30             1,077 Untitled2.ipynb
01-09-2023  01:35             1,077 Untitled3.ipynb
02-09-2023  10:51             3,160 Untitled4.ipynb
03-09-2023  10:26                72 Untitled5.ipynb
03-09-2023  11:48                72 Untitled6.ipynb
04-09-2023  11:56               589 Untitled7.ipynb
04-09-2023  12:18                72 Untitled8.ipynb
05-09-2023  12:18            22,570 Untitled9.ipynb
10-03-2023  16:48    <DIR>          Videos
              36 File(s)        760,318 bytes
              37 Dir(s)  21,713,018,880 bytes free

In [45]:
df = pd.read_excel('my_excel_file.xlsx', sheet_name='First_Sheet')

In [46]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [47]:
wb = pd.ExcelFile('my_excel_file.xlsx')

In [48]:
wb.sheet_names

['First_Sheet']

In [49]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx', sheet_name = None)

In [50]:
type(excel_sheet_dict)

dict

In [51]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [52]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [53]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [54]:
our_df = excel_sheet_dict['First_Sheet']

In [56]:
our_df.to_excel('example.xlsx', sheet_name='First_Sheet', index=False)

In [60]:
import pandas as pd
import numpy as np

In [61]:
from sqlalchemy import create_engine

In [62]:
temp_db = create_engine('sqlite:///:memory:')

In [63]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100, size=(4,4)), columns=['a','b','c','d'])

In [64]:
df

    a   b   c   d
0  65  44  71  88
1   1  28  80   6
2  69  89   1  84
3  95   4  25   0

In [65]:
df.to_sql(name='new_table',con=temp_db)

4

In [67]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [68]:
new_df

   index   a   b   c   d
0      0  65  44  71  88
1      1   1  28  80   6
2      2  69  89   1  84
3      3  95   4  25   0

In [70]:
result = pd.read_sql_query(sql="SELECT a,c FROM new_table", con=temp_db)

In [71]:
result

    a   c
0  65  71
1   1  80
2  69   1
3  95  25